//switch და ternary operator კომბინირებული გამოყენება,
//მოამზადე პროგრამა, რომელიც switch -ით განსაზღვრავს 
// თვის სახელს 1-12 შუალედში შეყვანილი რიცხვის მიხედვით 
// და ternary operator -ს იყენებს, რათა განსაზღვროს, არის თუ არა ეს თვე წელიწადის პირველი 
// ან მეორე ნახევარი.მაგალითად:თუ შეყვანილია 5:Switch -> "მაისი"Ternary -> "პირველი ნახევარი".

let month = Number(prompt("შეიყვანე თვის ნომერი (1-12):"))

let monthName;

switch (month) {
    case 1:
        monthName = "იანვარი"
        break
    case 2:
        monthName = "თებერვალი" 
        break
    case 3:
        monthName = "მარტი" 
        break
    case 4:
        monthName = "აპრილი" 
        break
    case 5:
        monthName = "მაისი"
        break
    case 6:
        monthName = "ივნისი"
        break
    case 7:
        monthName = "ივლისი" 
        break
    case 8:
        monthName = "აგვისტო" 
        break
    case 9:
        monthName = "სექტემბერი"
        break
    case 10:
        monthName = "ოქტომბერი" 
        break
    case 11:
        monthName = "ნოემბერი"
        break
    case 12:
        monthName = "დეკემბერი"
        break
    default:
        monthName = "არასწორი თვე"
}

console.log(monthName)
let half = (month >= 1 && month <= 12) ? (month <= 6 ? "პირველი ნახევარი" : "მეორე ნახევარი"): "დადგენილი არ არის"

console.log(half)

//მაქსიმალური რიცხვის პოვნა, , დაწერეთ პროგრამა, რომელიც იღებს ორ მთელ 
// რიცხვს., გამოიყენეთ ternary ოპერატორი იმის დასადგენად, თუ რომელი რიცხვია
//  მეტი., გამოიტანეთ შეტყობინება, რომელიც მიუთითებს მაქსიმალურ რიცხვს., მაგალითად,
//  თუ შეყვანილია 15 და 8, პროგრამამ უნდა გამოიტანოს: "მაქსიმალური რიცხვია: 15".

let num1 = Number(prompt("შეიყვანე პირველი რიცხვი:"))
let num2 = Number(prompt("შეიყვანე მეორე რიცხვი:"))


 console.log(num1 === num2 ? "ორივე რიცხვი ტოლია: " + num1 : "მაქსიმალური რიცხვია: " + (num1 > num2 ? num1 : num2))

// 4. პაროლის სიგრძის შემოწმება
 // დაწერეთ პროგრამა, რომელიც იღებს მომხმარებლისგან პაროლს (String ტიპის ცვლადს).
 // გამოიყენეთ ternary ოპერატორი იმის დასადგენად, არის თუ არა პაროლის სიგრძე 8 სიმბოლოზე მეტი ან ტოლი.
 // გამოიტანეთ შეტყობინება, რომელიც მიუთითებს, არის თუ არა პაროლი "საკმარისად გრძელი" თუ "ძალიან მოკლე".
//მაგალითად, თუ შეყვანილია "MySecurePassword", პროგრამამ უნდა გამოიტანოს: "პაროლი საკმარისად გრძელია". 
// ხოლო თუ შეყვანილია "Pass1", უნდა გამოიტანოს: "პაროლი ძალიან მოკლეა".

let password = prompt("შეიყვანე პაროლი:")
let message = password.length >= 8 ? "პაროლი საკმარისად გრძელია" : "პაროლი ძალიან მოკლეა"
console.log(message)

//# 5. ფასდაკლების განსაზღვრა
 //დაწერეთ პროგრამა, რომელიც იღებს მომხმარებლის მიერ შეძენილი საქონლის რაოდენობას (მთელი რიცხვი).
// გამოიყენეთ ternary ოპერატორი შემდეგი ფასდაკლების ლოგიკის დასადგენად:
//თუ რაოდენობა მეტია ან ტოლია 10-ზე, ფასდაკლება არის 10%. წინააღმდეგ შემთხვევაში, ფასდაკლება არის 0%.
//გამოიტანეთ შეტყობინება, რომელიც მიუთითებს გამოყენებულ ფასდაკლების პროცენტს.მაგალითად, თუ შეყვანილია 12,
//  პროგრამამ უნდა გამოიტანოს: "თქვენი ფასდაკლებაა: 10%". ხოლო თუ შეყვანილია 5, უნდა გამოიტანოს: "თქვენი ფასდაკლებაა: 0%".

let amount = Number(prompt("შეიყვანე საქონლის რაოდენობა:"))
let discount = (amount >= 10) ? 10 : 0

console.log("თქვენი ფასდაკლებაა: " + discount + "%")

