//# 2. 1-დან 10-მდე რიცხვების ჯამი
//დავალება:შექმენით for loop, რომელიც გამოთვლის 1- დან 10 -მდე 
// რიცხვების ჯამს, საბოლოო შედეგი გამოიტანეთ console - ში.
let sum = 0
for (let i = 1; i <= 10; i++) {
    sum += i
}
console.log( sum)

//# 3. რიცხვების კვადრატი
//დავალება:შექმენით  for loop, რომელიც ამობეჭდავს 1-დან 10-მდე თითოეული 
// რიცხვის კვადრატს.შედეგი უნდა გამოიყურებოდეს შემდეგნაირად:
//'X - ის კვადრატი არის X'
for (let i = 1; i <= 10; i++) {
    console.log(i + " - ის კვადრატი არის " + (i * i))
}

//# 4. სტრინგის თითოეული ასოს დაბეჭდვა
//დავალება:შექმენით string ტიპის ცვლადი, მაგალითად "გამარჯობა", და for loop-ის გამოყენებით 
// ამობეჭდეთ მისი თითოეული ასო.გამოიყენეთ length.
let s = "გამარჯობა"

for (let i = 0; i < s.length; i++) {
    console.log(s[i])
}

//# 5. FizzBuzz
//შექმენით FizzBuzz პროგრამა, რომელიც მუშაობს შემდეგნაირად
//1. თუ რიცხვი უნაშთოდ იყოფა 3-ზე, დაიბეჭდოს "Fizz".
//2. თუ რიცხვი უნაშთოდ იყოფა 5-ზე, დაიბეჭდოს "Buzz".
//3. თუ რიცხვი უნაშთოდ იყოფა ორივე (3-ზეც და 5-ზეც), დაიბეჭდოს "FizzBuzz".
//4. თუ არცერთი პირობა არ შესრულდება, დაიბეჭდოს თავად რიცხვი

for (let i = 1; i <= 100; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
        console.log("FizzBuzz")
    } else if (i % 3 === 0) {
        console.log("Fizz")
    } else if (i % 5 === 0) {
        console.log("Buzz")
    } else {
        console.log(i)
    }
}
