//# 1 მარტივი კალკულატორi:დაწერე პროგრამა, რომელიც ითვლის ორი რიცხვის ჯამს, სხვაობას, ნამრავლს და განაყოფს.
//Output:
//ჯამი: [რეზულტატი]
//სხვაობა: [რეზულტატი]
//ნამრავლი: [რეზულტატი]
//განაყოფი: [რეზულტატი] 

let num1 = 75
let num2 = 25

console.log("ჯამი: " + (num1 + num2))
console.log("სხვაობა: " + (num1 - num2))
console.log("ნამრავლი: " + (num1 * num2))
console.log("განაყოფი: " + (num1 / num2))

// 2.შექმენით 3 ცვლადი, რომელიც არის let - ით შექმნილი და მიანიჭეთ მნიშვნელობები.

let name = "tako"
let age = 16
let surname = "svanidze"

// 3.შექმენით 3 ცვლადი, რომელიც არის const - ით შექმნილი და მიანიჭეთ მნიშვნელობები.

const word1 = "GOA"
const word2 = "is"
const word3 = "best"

//4 ,5,6 ახსენით კომენტარებით თუ რა არის let,
// ახსენით კომენტარებით თუ რა არის const,
// ახსენით კომენტარებით თუ რა განსხვავებაა let - ს,  const - ს და var - ს შორის.

// let გამოიყენება ცვლადის შესაქმნელად, რომლის მნიშვნელობაც 
// შეიძლება შემდეგში შეიცვალოს.
// const  ესეც ცვლადია, მაგრამ მისი მნიშვნელობა აღარ შეიცვალება.
// ანუ ის მუდმივ მნიშვნელობას ინახავს.

// let  ცვლადი, რომლის მნიშვნელობა შეიძლება შეიცვალოს (თანამედროვე და უსაფრთხო გზა).
// const  ცვლადი, რომლის მნიშვნელობა აღარ იცვლება (მუდმივი მნიშვნელობა).
// var  ძველი ტიპის ცვლადია, ადრე გამოიყენებოდა, მაგრამ დღეს იშვიათად იყენებენ.