//პაროლის გამოცნობა,
//შექმენით password ცვლადი და მიანიჭეთ მნიშვნელობა 'Group 41 is best'თქვენი დავალებაა, რომ შექმნათ
//  ფუნქცია და გამოიცნოთ პაროლი იქამდე, სანამ პაროლი არ იქნება სწორი, მთლიანობაში გაქვთ 3 ცდა, როდესაც
//  ცდების რაოდენობა გამოილევა, alert - ის დახმარებით გამოიტანეთ მესიჯი 'თქვენ ამოგეწურათ ცდების რაოდენობა',
//  როდესაც პაროლი იქნება სწორი, გამოიტანეთ ' თქვენი შეყვანილი პაროლი სწორია'. 

const password = 'Group 41 is best';

for (let i = 3; i > 0; i--) {
  const userInput = prompt(
    "შეიყვანეთ პაროლი. დარჩენილი ცდები: " + i
  );

  if (userInput === password) {
    alert("თქვენი შეყვანილი პაროლი სწორია");
    break;
  }

  if (i === 1) {
    alert("თქვენ ამოგეწურათ ცდების რაოდენობა");
  }
}

// 2) N რიცხვის ფაქტორიალის გამოთვლა,
//for ციკლის დახმარებით გამოითვალეთ ნებისმიერი N რიცხვის ფაქტორიალი.

let N = Number(prompt("შეიყვანეთ რიცხვი N"))

for (let i = N - 1; i > 0; i--) {
  N = N * i
}

alert("ფაქტორიალია: " + N)

//უკუთვლა,შექმენით ფუნქცია, რომელიც 100 - დან 0 - ის  ჩათვლით გამოიტანს რიცხვებს,
//  ყოველ რიცხვზე უნდა გამოიტანოს 'დარჩენილია x წამი'

function countdown() {
  for (let i = 100; i >= 0; i--) {
    console.log("დარჩენილია " + i + " წამი")
  }
}
countdown()

//# 4. დაწერე for ციკლი, რომელიც გამოიტანს 1-დან 20-მდე ყველა რიცხვს, მაგრამ გამოტოვებს 7-ს და 13-ს.
//# 5. დაწერეთ ციკლი, რომელიც გაივილის რიცხვებს 1-დან 30-მდე, გამოტოვეთ ყველა კენტი რიცხვი
//  და შეაჩერეთ პროგრამა, როდესაც რიცხვი გაიყოფა 8 - ზე.
//# 6. შექმენით for ციკლი, რომელიც ამოწმებს რიცხვებს 1-დან 30-მდე, გამოტოვეთ რიცხვები, რომლებიც იყოფა 5 - ზე.

//4.
for (let i = 1; i <= 20; i++) {
  if (i !== 7 && i !== 13) {
    console.log(i)
  }
}
//5.
for (let i = 1; i <= 30; i++) {
  if (i % 2 === 0) { 
    if (i % 8 === 0) {
      break
    }
    console.log(i)
  }
}
//6.
for (let i = 1; i <= 30; i++) {
  if (i % 5 !== 0) {
    console.log(i)
  }
}

//7.The break statementThe given code declares a loop and calculates
//  the multiplication of all numbers from 1 to 10000.Make the necessary 
// changes to break the loop when the result is larger than 10000 and output the result.

let result = 1

for (let i = 1; i <= 10000; i++) {
  result = result * i

  if (result > 10000) {
    break
  }
}
console.log("result: " + result);
